app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)

    if @comment.save
---
INSERT INTO "comments" ("name", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "aditi"], ["comment", "blah blah blah"], ["created_at", "2015-07-17 18:49:44.233745"], ["updated_at", "2015-07-17 18:49:44.233745"]]

  def update
    @comment = Comment.find(params[:id])
    if @comment.update_attribute(:filtered, "true")
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "comments" SET "filtered" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["filtered", "t"], ["updated_at", "2015-07-17 18:50:02.919335"], ["id", 1]]

  def destroy_all
    if Comment.all.count >= 1 && Comment.delete_all(:filtered => true)
---
DELETE FROM "comments"
SELECT COUNT(*) FROM "comments"

  def deleteAllUnapproved
    if Comment.where(:filtered => false).count >= 1 && Comment.destroy_all(:filtered => false)
---
SELECT "comments".* FROM "comments" WHERE "comments"."filtered" = 'f'

  def destroy
    if @comment.destroy
---
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 6]]