app/controllers/moderator_controller.rb

	def index
		# Displays most recent tweets and comments in moderator page
		@tweets = Tweet.where(:filtered => false).reverse_order
		@comments = Comment.where(:filtered => false).reverse_order

		# Displays tweets and comments on iWall in moderator page
		@iWallTweets = Tweet.where(:filtered => true).reverse_order
		@iWallComments = Comment.where(:filtered => true).reverse_order

    	# Counts how many tweets and comments currently on the iWall
    	@iWallTweetsCount = Tweet.where(:filtered => true).count
    	@iWallCommentsCount = Comment.where(:filtered => true).count
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."filtered" = 'f'  ORDER BY "tweets"."id" DESC
SELECT "comments".* FROM "comments" WHERE "comments"."filtered" = 'f'  ORDER BY "comments"."id" DESC
SELECT COUNT(*) FROM "tweets" WHERE "tweets"."filtered" = 't'
SELECT COUNT(*) FROM "comments" WHERE "comments"."filtered" = 't'

	def pullNewTweets
		# Search query for tweets using Twitter API
		@search = $twitter.search("#{@@keyword} -filter:retweets", lang: "en").take(10)

		# Adds tweets to the SQLite database
		@search.collect do |t|
    		tweet = Tweet.create do |u|
---
INSERT INTO "tweets" ("user_name", "profile_pic", "screen_name", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)