app/controllers/pages_controller.rb

SELECT "tweets".* FROM "tweets"
SELECT "comments".* FROM "comments"
---
	def home
		# Takes tweets and comments from the database
		@tweets = Tweet.all
		@comments = Comment.all