app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets"
---
	def index
      # Grabs all tweets in database
  		@tweets = Tweet.all

SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT 1  [["id", 54]]
DELETE FROM "tweets" WHERE "tweets"."id" = ?  [["id", 54]]
---
	def destroy
      # Finds tweet to delete
    	@tweet = Tweet.find(params[:id])
    	if @tweet.destroy

DELETE FROM "tweets" WHERE "tweets"."filtered" = 't'
SELECT COUNT(*) FROM "tweets"
---
  def destroy_all
    # Deletes all tweets in database
    if Tweet.all.count >= 1 && Tweet.delete_all(:filtered => true)

DELETE FROM "tweets" WHERE "tweets"."filtered" = 'f'
SELECT COUNT(*) FROM "tweets" WHERE "tweets"."filtered" = 'f'
---
  def deleteAllUnapproved
    # Deletes all unapproved tweets in database
    if Tweet.where(:filtered => false).count >= 1 && Tweet.delete_all(:filtered => false)

SELECT COUNT(*) FROM "tweets" WHERE "tweets"."filtered" = 'f'
UPDATE "tweets" SET "filtered" = 't'
---
  def approveAll
    if (Tweet.where(:filtered => false).count) >= 1 && Tweet.update_all( :filtered => true )

SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT 1  [["id", 30]]
UPDATE "tweets" SET "filtered" = ?, "updated_at" = ? WHERE "tweets"."id" = ?  [["filtered", "t"], ["updated_at", "2015-07-22 13:26:15.821430"], ["id", 30]]
---
  def update
    @tweet = Tweet.find(params[:id])
    if @tweet.update_attribute(:filtered, "true")